//Rr_{
//инстркция по внедрению БСП
Процедура ПриДобавленииПодсистемы(Описание) Экспорт   
	Описание.Имя = "Информбюро";
	Описание.Версия = "1.0.1.4";
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия = "1.0.1.1";
	//Обработчик.Процедура = "ОбновлениеИнформационнойБазыИБ.ОбновлениеНа_1_0_1_1";
	//Обработчик.НачальноеЗаполнение = {Истина|Ложь};
	//Обработчик.РежимВыполнения = {"Монопольно"|"Оперативно"|"Отложенно"};
	
	//Обработчик = Обработчики.Добавить();
	//Обработчик.Версия = "1.2.3.4";
	//Обработчик.Процедура = "Заказы.ЗаполнитьСтатусЗаказовПокупателей";
	//Обработчик.РежимВыполнения = "Отложенно";
	//Обработчик.Идентификатор = Новый УникальныйИдентификатор("83d5c5dd-1462-4d72-ab98-f8f5dcc0664d");
	//Обработчик.Комментарий = НСтр("ru = 'Заполняет значение нового реквизита СтатусЗаказа у документов ""Заказ покупателя"" прошлых периодов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыИБ.ВыполнятьВсегдаПриСменеВерсии";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.2";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыИБ.ОбновлениеНа_1_0_1_2";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Зполнение элементов, согласно инструкциям по внедрению БСП.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыИБ.ОбновлениеНа_1_0_1_3";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Зполнение элементов, согласно инструкциям по внедрению БСП.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.4";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыИБ.ОбновлениеНа_1_0_1_4";
	Обработчик.РежимВыполнения = "Монопольно";
	Обработчик.Комментарий = НСтр("ru = 'Зполнение элементов, согласно инструкциям по внедрению БСП.'");
		
КонецПроцедуры

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
		
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
КонецПроцедуры

Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
		
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
		
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры 

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
КонецПроцедуры


Процедура ОбновлениеНа_1_0_1_1() экспорт
	
	
КонецПроцедуры

Процедура ОбновлениеНа_1_0_1_2() экспорт
	
	ВсеОбъектыАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.ВсеОбъектыАдресации;
	
	
	РольОбъект = Справочники.РолиИсполнителей.СпециалистТехническойПоддержки.ПолучитьОбъект();
    РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
    РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.КраткоеПредставление = "Саппорт";
	РольОбъект.Комментарий = НСтр("ru = 'Все специалисты внутренней и внешней технической поддержки'");
	РольОбъект.ВнешняяРоль = ложь;
    РольОбъект.ТипыОсновногоОбъектаАдресации = ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Партнеры;
	
	НазначениеРоли = РольОбъект.Назначение.Добавить();
	НазначениеРоли.ТипПользователей = Справочники.Партнеры.ПустаяСсылка();

    РольОбъект.Записать();
	
	
	РольОбъект = Справочники.РолиИсполнителей.ОтветственныйЗаКонтрольИсполнения.ПолучитьОбъект();
    РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
    РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.КраткоеПредставление = "Контроль дедлайнов";
	РольОбъект.Комментарий = НСтр("ru = 'Предопределенная в БСП роль, используется для получения уведомлений о просроченных и зависших задачах. Сотрудники, назначенные на роль, получают уведомления по всем таким задачам, адресованным любым исполнителям'");
	РольОбъект.ВнешняяРоль = ложь;
    РольОбъект.ТипыОсновногоОбъектаАдресации = ВсеОбъектыАдресации;
    РольОбъект.Записать();
	
	РольОбъект = Справочники.РолиИсполнителей.Оператор.ПолучитьОбъект();
    РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
    РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.КраткоеПредставление = "Оператор";
	РольОбъект.Комментарий = НСтр("ru = 'Специалисты по оформлению документов во внешних базах 1С и других'");
	РольОбъект.ВнешняяРоль = ложь;
    РольОбъект.ТипыОсновногоОбъектаАдресации = ВсеОбъектыАдресации;
    РольОбъект.Записать();
	
	РольОбъект = Справочники.РолиИсполнителей.РуководительОтделаТехническойПоддаржки.ПолучитьОбъект();
    РольОбъект.ИспользуетсяБезОбъектовАдресации = Истина;
    РольОбъект.ИспользуетсяСОбъектамиАдресации = Истина;
	РольОбъект.КраткоеПредставление = "Руководитель техподдержки";
	РольОбъект.Комментарий = НСтр("ru = 'Планирование и контроль работы саппорта'");
	РольОбъект.ВнешняяРоль = ложь;
    РольОбъект.ТипыОсновногоОбъектаАдресации = ВсеОбъектыАдресации;
    РольОбъект.Записать();	
	
КонецПроцедуры

Процедура ОбновлениеНа_1_0_1_3() экспорт
	
	РольОбъект = Справочники.РолиИсполнителей.СпециалистТехническойПоддержки.ПолучитьОбъект();
	РольОбъект.Комментарий = НСтр("ru = 'Все специалисты внутренней и внешней технической поддержки'");
    ЗаписатьОбъект(РольОбъект);	
	
	РольОбъект = Справочники.РолиИсполнителей.ОтветственныйЗаКонтрольИсполнения.ПолучитьОбъект();
	РольОбъект.Комментарий = НСтр("ru = 'Предопределенная в БСП роль, используется для получения уведомлений о просроченных и зависших задачах. Сотрудники, назначенные на роль, получают уведомления по всем таким задачам, адресованным любым исполнителям'");
    ЗаписатьОбъект(РольОбъект);	
	
	РольОбъект = Справочники.РолиИсполнителей.Оператор.ПолучитьОбъект();
	РольОбъект.Комментарий = НСтр("ru = 'Специалисты по оформлению документов во внешних базах 1С и других'");
    ЗаписатьОбъект(РольОбъект);	
	
	РольОбъект = Справочники.РолиИсполнителей.РуководительОтделаТехническойПоддаржки.ПолучитьОбъект();
	РольОбъект.Комментарий = НСтр("ru = 'Планирование и контроль работы саппорта'");
    ЗаписатьОбъект(РольОбъект);	
	
КонецПроцедуры

Процедура ОбновлениеНа_1_0_1_4() экспорт
	ОбновлениеНа_1_0_1_2();
	ОбновлениеНа_1_0_1_3();
КонецПроцедуры	


Процедура ВыполнятьВсегдаПриСменеВерсии() экспорт
	
КонецПроцедуры

//Использовать для записи объектов (см. рекомендации по внедрению БСП)
Процедура ЗаписатьОбъект(ЗаписываемыйОбъект)
	
	ЗаписываемыйОбъект.ОбменДанными.Загрузка = Истина; // отключить всю бизнес-логику при записи
	ЗаписываемыйОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов"); 
	ЗаписываемыйОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ЗаписываемыйОбъект.Записать();
	
КонецПроцедуры

//}Rr_