
функция ЗначениеИмеетТип(значение, тип) экспорт
	
	если типЗнч(тип) = тип("Строка") тогда
	
		возврат ТипЗнч(значение) = тип(тип);
		
	конецЕсли;
	//todo: дололнить проверками, если параметр "тип" не строка
КонецФункции


Функция ПолучитьПустоеЗначениеПоТипу(ЗаданныйТип) экспорт
	
	Если тип(ЗаданныйТип) = Тип("Число") Тогда
        Возврат 0;
    ИначеЕсли тип(ЗаданныйТип) = Тип("Строка") Тогда
        Возврат "";
    ИначеЕсли тип(ЗаданныйТип) = Тип("Дата") Тогда
        Возврат '00010101000000';
    ИначеЕсли тип(ЗаданныйТип) = Тип("Булево") Тогда
        Возврат Ложь;
    Иначе
        Возврат Новый (ЗаданныйТип);
    КонецЕсли;
	
КонецФункции